import 'package:flutter/material.dart';
import 'package:get/get.dart';

class TermsAndConditionsScreen extends StatelessWidget {
  const TermsAndConditionsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(
          icon: Icon(Icons.arrow_back_ios, color: Colors.white),
          onPressed: () => Get.back(),
        ),
        title: Text('terms_and_conditions'.tr,
            style: TextStyle(color: Colors.white)),
        backgroundColor: Get.theme.primaryColor,
      ),
      body: Container(
        height: MediaQuery.of(context).size.height,
        width: MediaQuery.of(context).size.width,
        // margin: EdgeInsets.only(top: 15),
        decoration: BoxDecoration(
          gradient: LinearGradient(
            begin: Alignment.topRight,
            end: Alignment.bottomLeft,
            colors: [
              Get.theme.primaryColor,
              Get.theme.colorScheme.secondary,
            ],
          ),
        ),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.center,
            // mainAxisAlignment: MainAxisAlignment.center,
            children: [
              Padding(
                padding: EdgeInsets.only(
                  right: Get.width / 8,
                  left: Get.width / 8,
                  top: 20,
                  bottom: 20,
                ),
                child: Image.asset(
                  "asset/Images/white_logo.png",
                  height: 80,
                  fit: BoxFit.cover,
                ),
              ),
//               SizedBox(height: 10),
//               Padding(
//                 padding: const EdgeInsets.only(right: 10.0),
//                 child: Align(
//                   alignment: Alignment.centerRight,
//                   child: Text(
//                     'الشروط والأحكام',
//                     style: TextStyle(
//                         color: Colors.white,
//                         fontSize: 15,
//                         fontWeight: FontWeight.w600),
//                   ),
//                 ),
//               ),
//               SizedBox(height: 10),
//               Padding(
//                 padding: const EdgeInsets.symmetric(horizontal: 15.0),
//                 child: Text('''
// تطبيق فيتنس ستورم يمكن الزوار والمشتركين من ممارسة التمارين الرياضية بصحبة أشهر مدربي اللياقة البدنية من خلال سلسلة من الفيديوهات المصورة عالية الجودة .
//
// تطبيق فتنس ستورم
// هذاالتطبيق ملك شركة مسجلة في المملكة العربية السعودية ونحن نعمل كمنصة إلكترونية تمكن المشتركين من تحقيق هدفهم الرياضي من خلال ممارسة سلسلة من التمارين الرياضية التي تم اعدادها وتحضيرها من قبل أهم مدربي اللياقة البدنية من حول العالم.
//
// استخدام هذا التطبيق
// جميع المواد المنشورة على هذا التطبيق تخضع لحقوق الطبع والنشر التي تملكها شركة فيتنس ستورم فلا يجوز النسخ، وإعادة الإرسال، أو إعادة النشر. إن استخدامك أو مشاركتك في هذا التطبيق، يعني قراءتك لهذه الشروط وموافقتك على الالتزام بها. إذا لم توافق على الالتزام بها، يفضل عدم الاشتراك بخدماتنا وزيارة تطبيقنا.
// يحتفظ تطبيق فيتنس ستورم بحق تحديث شروط الاستخدام كلما دعت الضرورة، وعليه نرجو الاطلاع على تحديث شروط الاستخدام باستمرار.
// اذا كنت قاصراً، أي تحت سن 18 عاماً ولكن لا يقل عن 16 عاماً، فلا يجوز لك إستخدام هذا التطبيق إلا تحت إشراف أحد الوالدين أو الوصي القانوني الذي يوافق على الالتزام بشروط الاستخدام هذه.
// إذا كان عمرك أقل من 18 عاماً، يمكن لوالديك أو الأوصياء القانونيين التعامل نيابة عنك إذا كانوا مستخدمين / أعضاء مسجلين.
//
// شروط استخدام التطبيق
// لا يجوز للعميل الذي يستخدم التطبيق ممن هم قاصرون / أقل من 18 عامًا التسجيل كمستخدم للتطبيق ولا يجوز لهم التعامل أو استخدام التطبيق دون مراقبة ولي الأمر.
// ✔	يرجى من المشترك الاحتفاظ بنسخة من الفواتير عند الدفع الكترونيا.
// ✔	المستخدم مسؤول عن الحفاظ على سرية حسابه. فلا يجوز ان  تبادل معلومات حسابك مع أي شخص آخر و نشر و توزيع معلومات الدخول الى حسابك
// ✔	يحتفظ المطور الحق في إلغاء الحساب في حالة العثور على أي إساءة في استخدام التطبيق أو استخدام ألفاظ مسيئة بحق التطبيق والمدربين والمشتركين.
// ✔	يوفر التطبيق تمارين متعددة المستويات للمبتدئين ومعتدلي اللياقة البدنية والمحترفين، وبناءا على بياناتك وقدراتك الجسدية نزودك بالتمارين المناسبة لك لذلك نرجو بإدخال بياناتك بشكل صحيح ودقيق.
// ✔	المشترك يتحمل مسؤولية اختيار المدرب والتمارين الأنسب له، والتطبيق غير مسؤول عن أي اصابة أو أذى قد تحدث له اثناء ممارسة التمارين أو تأدية احد التمارين بشكل خاطىء. وبحال حدوث اي أذى أو ألم يفضل مراجعة الطبيب فورا.
// ✔	تقع على المشترك مسوؤلية التأكد من سلامته وقدرته على ممارسة أي تمرين وعدم إجبار نفسه على تأدية تمارين عالية المستوى ولا تناسب قدراته الجسدية.
// ✔	ان كنت تعاني من حالة صحية معينة أو قمت بإجراء عملية جراحية يرجى استشارة الطبيب قبل التسجيل بالتطبيق.
// ✔	ان كنت حامل او مرضعه ، يرجى أخذ موافقة طبيبك على ممارسة التمارين الموجودة على التطبيق.
//
// الشروط والأحكام للتدريب الشخصى :
// -لا يمكن استرداد مقابل جلسات التدريب الشخصى ويجب الإلتزام بموعد بدء الجسات و نهايتها .
// -قد تنشأ ظروف غير متوقعة تنتج عنها اعادة جدولة الجلسات , فى هذه الحالة ستطبق السياسة التالية :
// -اذا اضررت الى الغاء الجلسة خلال 24 من تاريخ الحجز فسيتم تعويض الجلسة بدون مقابل.
// -فى حالة الغاء الجلسة  فى نفس اليوم يتم خصم الجلسة من الجلسات المتبقية .
// -تخضع جلسات التدريب الشخصى الى فترة انتهاء 30 يوم من تاريخ الإشتراك.
// - مدة الحصة تكون ما بين 45 دقيقة حتى ساعة واحدة.
// -لا يمكن تسجيل الحصة عبر الفيديو حيث تخضع للسرية ما بين المدرب و المتدرب.
// -لا يمكن تبادل الارقام / الايميل بين المدرب و المتدرب وتقدم الخدمة عن طريق فتنس ستورم.
// -التأجيل يكون حصتين شهريا .
// - يجب الابلاغ بالتأجيل قبل موعد السيشن بيوم على الاقل والا يعتبر السيشن ملغي.
// - يجب تحديد موعد لتعويض السيشن المؤجله في خلال اسبوع يبدأ من يوم التأجي او تعتبر السيشن ملغيه .
//
// طرق الدفع
// بإمكانك الدفع عن طريق وسائل الدفع المتاحة على التطبيق بالريال السعودي أو الدولار الأمريكي.
//
// تأكيد الدفعة
// بمجرد إجراء الدفع ، سيتم إرسال إشعار التأكيد إلى العميل عبر البريد الإلكتروني في غضون 24 ساعة من استلام الدفع.
//
// أحكام القانون والاختصاص القضائي
// أي عملية شراء أو نزاع أو مطالبة تنشأ عن أو تتعلق بهذا التطبيق يجب أن تخضع لقوانين المملكة العربية السعودية.
//
// قد يتم تغيير سياسات وشروط التطبيق أو تحديثه من حين لآخر لتلبية المتطلبات والمعايير. لذلك، ننصح العملاء بزيارة صفحة الشروط والأحكام بشكل متكرر حتى يتم الاطلاع على آخر التحديثات. ستكون القوانين المعدلة سارية المفعول منذ يوم نشرها.
//
//                      ''',
//                     style: TextStyle(color: Colors.white),
//                     textAlign: TextAlign.justify,
//                     textDirection: TextDirection.rtl,
//                     maxLines: 100),
//               ),
//               SizedBox(height: 10),
//               Divider(color: Colors.white),
              Padding(
                padding: const EdgeInsets.only(left: 10.0),
                child: Align(
                  alignment: Alignment.centerLeft,
                  child: Text(
                    'terms_and_conditions'.tr,
                    style: TextStyle(
                        color: Colors.white,
                        fontSize: 15,
                        fontWeight: FontWeight.w600),
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.symmetric(horizontal: 15.0),
                child: Text('terms&conditions'.tr,
                    style: TextStyle(color: Colors.white),
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.ltr,
                    maxLines: 100),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
