Repository: saedAlHanash/untitled
Catalog: lib/l10n/intl_*.arb
Languages: ar

# verificationSentSuccessfully
source: Verification Code Has Been Sent Successfully
ar: تم إرسال رمز التأكيد بنجاح

source: verify
ar: تأكيد

source: Not Login
ar: لم يتم تسجيل الدخول

source: Enter Password
ar: أدخل كلمة المرور

source: Enter Your Name
ar: أدخل الاسم

# weightFieldIsRequire
source: Weight Field is Required
ar: حقل الوزن مطلوب

# hightFieldIsRequire
source: Height Field is Require
ar: حقل الطول مطلوب

# howManyYouTrainingFieldIsRequire
source: How many training days field is required
ar: كم عدد أيام التدريب مطلوب

source: Training Level Field is Require
ar: المستوى التدريبي مطلوب

source: Training Goal Field is Require
ar: مجال أهداف التدريب مطلوب

source: Weight
ar: الوزن

source: in Kg
ar: بالكيلوغرام

# hight
source: Height
ar: الطول

source: in Cm
ar: بالسنتيمتر

source: Hours/Day
ar: عدد الساعات في اليوم

source: SEARCH
ar: بحث

# searchSmall
source: Search
ar: بحث

source: Apply
ar: تطبيق

source: See Result
ar: رؤية النتائج

source: Our Plans
ar: برامجنا

source: Workout
ar: التدريب

source: Progress
ar: مستوى التقدّم

source: UPGRADE PLAN
ar: ترقية البرنامج

source: Choose a Plan
ar: اختر البرنامج

source: Notifications
ar: الإشعارات

source: skip
ar: تخطّي

source: Enjoy your Fitness Storm.
ar: استمتع بتجربتك معنا

# notSuccessfullySubscription
source: Unsuccessful subscription
ar: لم يتم الاشتراك

# notCompleteProcessPayment
source: Payment process not completed
ar: لم تتم عملية الدفع

source: Subscribe
ar: اشترك

source: Week
ar: اسبوع

source: What is Fitness Storm?
ar: ما هو Fitness Storm ؟

# itIsADynamicApplicationInBothArabic
source: It is a dynamic application in both Arabic and English languages that gives you a chance to train with world class trainers through HD step-by-step instructional videos.
ar: إنه تطبيق ديناميكي باللغتين العربية والإنجليزية يمنحك فرصة للتدريب مع مدربين عالميين من خلال مقاطع فيديو تعليمية عالية الدقة خطوة بخطوة.

source: Can I Subscribe if I live outside Saudi Arabia?
ar: هل يمكنني الاشتراك إذا كنت أعيش خارج المملكة العربية السعودية ؟

source: Sure, you can subscribe from anywhere in the globe.
ar: بالتأكيد، يمكنك الاشتراك من أي مكان في العالم.

source: Are there exercises for beginners?
ar: هل هناك تمارين للمبتدئين ؟

# yesSureBasedOnYourPersonal
source: Yes sure. Based on your personal info and physical activity, a list of high-HD exercise videos will show up to you. So, it doesn"t matter if you are a beginner or a Pro.
ar: نعم، بالتأكيد. بناءً على معلوماتك الشخصية ونشاطك البدني، ستظهر لك قائمة بمقاطع فيديو تمارين عالية الدقة. لذلك، لا يهم ما إذا كنت مبتدئًا أم محترفًا.

source: Yes, they can.
ar: نعم، يمكنهم ذلك.

source: Can I try your programs before subscribing?
ar: هل يمكنني تجربة برامجكم قبل الاشتراك ؟

source: What language is spoken in the videos?
ar: ما هي اللغة التي يتم التحدث بها في مقاطع الفيديو ؟

source: Arabic and some expressions in English
ar: العربية وبعض التعابير باللغة الانجليزية

source: Type Anything To Search It
ar: اكتب أي شيء للبحث عنه

source: What are you searching for?
ar: ما الذي تبحث عنه ؟

source: FAQ
ar: الأسئلة الشائعة

source: Something Went Wrong
ar: حدث خطأ ما

source: Failure
ar: فشلت العملية

source: Back
ar: السابق

source: New Password
ar: كلمة المرور الجديدة

source: Full Name
ar: الاسم الكامل

source: Mobile
ar: رقم الجوال

source: Height
ar: الطول

source: Your training level
ar: مستوى تمرينك

source: Bookmarked
ar: تم الحفظ

source: Contact Us
ar: اتصل بنا

source: Join us as a Trainer
ar: انضم إلينا كمدرب

# termsAndCondition
source: Terms and Conditions
ar: الأحكام والشروط

# sUBSCRIBERSCap
source: SUBSCRIBERS
ar: المشتركين

source: Congrats
ar: تهانينا

source: Public
ar: عام

source: Private
ar: خاص

source: Session with
ar: جلسة مع

source: Wallet
ar: محفظة

source: Calender
ar: تقويم

source: Trainer Profile
ar: الملف الشخصي للمدرّب

source: Logout
ar: تسجيل الخروج

source: Not Implemented
ar: لم ينفذ

source: Request Cancelled
ar: تم إلغاء الطلب

source: Internal Server Error
ar: خطأ في الخادم

source: Service unavailable
ar: الخدمة غير متوفرة

source: Method Allowed
ar: الطريقة المسموح بها

source: Bad request
ar: طلب خاطئ

source: Unauthorised request
ar: طللب غير مصرّح به

source: Connection request timeout
ar: خطأ في الاتصال

source: No internet connection
ar: لا يوجد اتصال بالانترنت

source: Error due to a conflict
ar: خطأ نتيجة تضارب في الخادم

source: Send timeout in connection with API server
ar: انتهى وقتت الاتصال

source: Unable to process the data
ar: غير قادر على معالجة البيانات

source: Unexpected error occurred
ar: حدث عطل غير متوقع

source: Not acceptable
ar: غير مقبول

source: Done
ar: نعم

source: confirm password
ar: تأكيد كلمة المرور

# alreadyPlay
source: This day was already finished
ar: تم الانتهاء من هذا اليوم

source: Renewal Price
ar: سعر التجديد

source: Are you sure?
ar: هل أنت متأكد؟

# cancelRenewal
source: Your subscription will NOT be renewed, you will be able to continue your fitness storm until your current subscription ends.
ar: لن يتم تجديد اشتراكك، لكن بإمكانك الاستفادة وإكمال تمارينك حتى انتهاء دورة اشتراكك الحالية.

# warningRenewal
source: Your subscription will be renewed with the new chosen bundle on
ar: سيتم تجديد اشتراكك بالباقة الجديدة المختارة بتاريخ

# whyCancel
source: Your Fitness Storm membership will not be renewed. However, you will be able to continue using your membership until its end date. Why would you like to cancel your subscription?
ar: لن يتم تجديد باقتك في فتنس ستورم. ومع ذلك، ستتمكن من الاستمرار في استخدام عضويتك حتى تاريخ انتهائها. ما هو سبب الغاء اشتراكك ؟

# warningDeleteAccount
source: Your account will be deleted with all your data, progress, and cancel any ongoing subscription.
ar: حذف الحساب سيؤدي لحذف كامل بياناتك وتقدمك، وإلغاء أي اشتراك جاري.

# startWithinPlan
source: Start training with this plan
ar: ابدأ التدريب بهذا البرنامج

# phone
source: Phone Number
ar: رقم الجوال

# coupon
source: Coupon Code
ar: كود الخصم

# supTotal
source: Subtotal
ar: الإجمالي

source: Voucher
ar: قيمة الخصم

source: Net Total
ar: المبلغ بعد الخصم

source: Cancel reason
ar: سبب الإلغاء

source: Available session
ar: جلسة متاحة

source: Let"s Go
ar: هيا نبدأ

source: Password Doesn"t Match
ar: كلمة السر غير مطابقة

source: Can I contact the coach directly?
ar: هل يمكنني التواصل مع المدرب مباشرة؟

source: No, this option is not available yet.
ar: لا، هذا الخيار غير متاح بعد.

source: Yes, sure there is 7 days free trial
ar: نعم، بالتأكيد هناك 7 أيام تجريبية مجانية

source: WORKOUT PLANS
ar: برامج التدريب

source: Video Call
ar: مكالمة فيديو

source: Old Session
ar: الجلسات السابقة

source: Bundles
ar: الباقات

source: Bundle
ar: الباقة

source: Sessions Count
ar: عدد الحصص

source: Remove
ar: حذف

source: Add
ar: إضافة

source: Wrong
ar: خطأ

source: Birth Date
ar: تاريخ الميلاد

source: Apply as Trainer
ar: التقدم كمدرب

source: CV
ar: السيرة الذاتية

source: send
ar: أرسال

source: request
ar: طلب

source: Booked
ar: حجز

source: Available
ar: متاح

source: No Plans Found
ar: لا يوجد خطط

source: Certificate Of Graduation
ar: شهادة التخرج

source: Certificate Of Course Attended
ar: شهادة حضور الدورة

# fullyBooked
source: This Coach is Fully Booked!
ar: هذا المدرب محجوز بالكامل!

# noteMe
source: Notify me when there is an available date
ar: أرسل إشعارا عندما يتوفر دروس

source: Next Session
ar: الجلسة القادمة

# haveCoupon
source: Have a coupon ?
ar: لديك كود خصم؟

source: Rating
ar: تقييم

source: Review
ar: مراجعة

source: Date
ar: تاريخ

source: Agreement
ar: الاتفاقية

# areYouSureFore
source: Are you sure you want to
ar: هل أنت متأكد من انك تريد

source: Time Left to end call
ar: الوقت المتبقي لإنهاء المكالمة

source: Welcome Message
ar: رسالة الترحيب

# guest
source: Continue as Guest
ar: المتابعة كضيف

source: Guest User
ar: مستخدم ضيف

source: Need login!
ar: يجب تسجيل الدخول!

# thxForApplyAsTrainer
source: Thank you for your interest in joining us! We have received your application and are currently reviewing it.
ar: نشكرك على اهتمامك بالانضمام معنا ! تلقينا طلبك ونقوم حاليا بمراجعته.
