Repository: saedAlHanash/untitled
Catalog: lib/l10n/intl_*.arb
Languages: ar

# sgnIn
source: Sign In.
ar: تسجيل الدخول

# confirmMethod
source: Please Choose How You Would Like To Send The Verification Code
ar: يرجى اختيار كيفية إرسال رمز التحقق

source: Phone Call
ar: مكالمة هاتفية

source: Phone SMS
ar: رسالة نصية عبر الهاتف

# enterOTP
source: Enter Your OTP Code Here.
ar: أدخل رمز OTP الخاص بك هنا

source: Resend
ar: إعادة الإرسال

source: Account Created!
ar: تم إنشاء الحساب

# haveBeenCreated
source: Your Account Had Been Created
ar: تم إنشاء حسابك

source: Successfully.
ar: بنجاح

source: Confirmation
ar: تأكيد

source: Number Phone
ar: رقم الهاتف

# passwordReset
source: Your Password Has Been Reset!
ar: تمت إعادة تعيين كلمة المرور الخاصة بك!

source: save change
ar: حفظ التغيير

source: Your Address
ar: عنوانك

source: Your Phone
ar: رقم هاتفك

source: Your Name
ar: اسمك

source: Your Email
ar: بريدك الإلكتروني

source: Current Password
ar: كلمة المرور الحالية

source: confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: first name
ar: الاسم الأول

source: Last name
ar: الاسم الأخير

source: Country
ar: البلد

source: Use Current Location
ar: استخدام الموقع الحالي

source: Other
ar: آخر

source: Registered Before
ar: مسجل سابقًا

source: My Info
ar: معلوماتي

source: My Orders
ar: طلباتي

source: WishList
ar: قائمة رغباتي

source: F.A.Q
ar: الأسئلة الشائعة

source: Support
ar: الدعم

source: Language
ar: اللغة

source: Currency
ar: العملة

source: Done resend code
ar: تم إعادة إرسال الرمز

source: Search In All
ar: البحث في الكل

source: Flash Deal
ar: صفقة سريعة

source: Offer
ar: عرض

source: Days
ar: أيام

source: Hours
ar: ساعات

source: Minutes
ar: دقائق

source: Price
ar: السعر

source: Description
ar: الوصف

source: Reviews
ar: التقييمات

source: Sizes
ar: الأحجام

source: Max
ar: الحد الأقصى

source: Apply filters
ar: تطبيق الفلاتر

source: Color
ar: اللون

source: Colors
ar: الألوان

# newCheckEmail
source: New Check Your Email For Confirmation Link
ar: تحقق من بريدك الإلكتروني للحصول على رابط التأكيد الجديد

source: Expiration
ar: انتهاء الصلاحية

source: Save For Later?
ar: حفظ لاحقًا؟

source: Location
ar: الموقع

source: Confirm Address
ar: تأكيد العنوان

source: Cvc
ar: رمز CVC

source: Card Name
ar: اسم البطاقة

source: Card Number
ar: رقم البطاقة

source: Payment Summary
ar: ملخص الدفع

source: Subtotal
ar: المجموع الفرعي

source: Filters
ar: الفلاتر

source: Additional service
ar: خدمة إضافية

source: Order summary
ar: ملخص الطلب

source: Coupon Code
ar: رمز الكود

# codeInvalid
source: This Code Is Invalid CODE
ar: هذا الرمز غير صالح

source: Wishlist
ar: قائمة الرغبات

source: Related Products
ar: المنتجات المرتبطة

source: Add To Cart
ar: أضف إلى السلة

source: Next
ar: التالي

source: New Arrival
ar: وصول جديد

# isRequired
source: Required
ar: مطلوب

source: Oops!
ar: عفوًا!

source: Enter New Password And Confirm.
ar: أدخل كلمة المرور الجديدة وتأكيدها.

source: Share
ar: مشاركة

source: update
ar: تحديث

source: governor
ar: المحافظة

source: receiverPhone
ar: هاتف المستلم

source: Select Governor
ar: اختر المحافظة

# selectFromMap
source: From Map
ar: من الخريطة

source: My Location
ar: موقعي

# helperPhoneText
source: start with 07 and 11 digit
ar: ابدأ بـ 07 وبـ 11 رقمًا

# emptySearch
source: Sorry, Your Search Is Not Available
ar: عذرًا ، بحثك غير متوفر

# emptyCart
source: Sorry, There Are No Requests
ar: عذرًا ، لا توجد طلبات

# emptyFav
source: Sorry, There Are No Requests
ar: عذرًا ، لا توجد طلبات

# emptyOffers
source: Sorry, There Are No Offers
ar: عذرًا ، لا توجد عروض

# emptyNotifications
source: Sorry, There Are No Notifications
ar: عذرًا ، لا توجد إشعارات

# emptyOrders
source: Sorry, There Are No Orders
ar: عذرًا ، لا توجد طلبات

source: Cash Payment
ar: الدفع نقدًا

source: E-Payment
ar: الدفع الإلكتروني

source: Payment Method
ar: طريقة الدفع

# donePending
source: Order Created
ar: تم إنشاء الطلب

# doneProcessing
source: Order Processed
ar: تم معالجة الطلب

# doneReady
source: Order Was Ready
ar: الطلب جاهز

# doneShipping
source: Order Shipped
ar: تم شحن الطلب

# doneCompleted
source: Order Completed
ar: تم استكمال الطلب

# doneCanceled
source: Order Canceled
ar: تم إلغاء الطلب

# donePaymentFailed
source: PaymentFailed
ar: فشل الدفع

# doneReturned
source: Order Returned
ar: تم إرجاع الطلب

source: At
ar: في

source: Pending
ar: قيد الانتظار

source: Processing
ar: قيد التجهيز

source: Ready
ar: جاهز

source: Shipping
ar: جاري الشحن

source: Canceled
ar: ملغى

source: Payment Failed
ar: فشل الدفع

source: Returned
ar: مُرجَع

source: Not Yet
ar: لم يحين بعد

source: Tracking Order
ar: تتبع الطلب

source: Your Order
ar: طلبك

source: Delivery Date
ar: تاريخ التسليم

source: Ready To Deliver
ar: جاهز للتوصيل

source: Estimated For
ar: متوقع لـ

source: Pleas Set Your Address
ar: يرجى تعيين عنوانك

source: Review Order
ar: مراجعة الطلب

source: Your Location
ar: موقعك

# wrongEmail
source: Invalid email
ar: بريد الكتروني غير صالح

source: Confirm
ar: تأكيد

source: Cart
ar: عربة التسوق

# fav
source: Favorites
ar: المفضلة

# myOrder
source: My Orders
ar: طلباتي

source: Phone Number
ar: رقم الهاتف

# pleasCreateAccount
source: Please create an account
ar: يرجى إنشاء حساب

source: Create Account
ar: إنشاء حساب

source: Username
ar: اسم المستخدم

source: Home Address
ar: عنوان المنزل

source: Region
ar: المنطقة

source: City
ar: المدينة

# rePassword
source: Confirm Password
ar: تأكيد كلمة المرور

# noInternet
source: Please check your internet connection
ar: يرجى التحقق من اتصالك بالإنترنت

# nameEmpty
source: Name field is required
ar: حقل الاسم مطلوب

# phoneNumberEmpty
source: Phone number field is required
ar: حقل رقم الهاتف مطلوب

# emailEmpty
source: Email field is required
ar: حقل البريد الإلكتروني مطلوب

# passwordEmpty
source: Password field is required
ar: حقل كلمة المرور مطلوب

# passwordNotMatch
source: Password does not match
ar: كلمة المرور غير متطابقة

# continueTo
source: Continue
ar: متابعة

# confirmCode
source: Enter Confirmation Code
ar: أدخل رمز التأكيد

# codeSentToEmail
source: Confirmation code sent to email:
ar: تم إرسال رمز التأكيد إلى البريد الإلكتروني:

source: About
ar: حول

# notification
source: Notifications
ar: الإشعارات

source: Settings
ar: الإعدادات

# policy
source: Terms of Use and Privacy Policy
ar: شروط الاستخدام وسياسة الخصوصية

# policyJust
source: Privacy Policy
ar: سياسة الخصوصية

# contact
source: Contact Us
ar: اتصل بنا

source: Change Name
ar: تغيير الاسم

source: Change Address
ar: تغيير العنوان

# changePass
source: Change Password
ar: تغيير كلمة المرور

# phoneNumberCanNotBeChange
source: Phone number cannot be changed
ar: لا يمكن تغيير رقم الهاتف

source: Continue Sign Up
ar: متابعة التسجيل

# wrongPhone
source: Invalid phone number
ar: رقم الهاتف غير صالح

source: Welcome Back!
ar: مرحبًا بعودتك!

source: Sign In To Continue
ar: تسجيل الدخول للمتابعة

source: Remember Me
ar: تذكرني

# signInWithSocial
source: Sign In With Social Networks:
ar: تسجيل الدخول باستخدام الشبكات الاجتماعية:

# need11
source: The Phone Number Is 11 Digits
ar: يجب أن يكون رقم الهاتف مؤلفًا من 11 رقمًا

# need8
source: The Password Is More Than 8 Letters And Numbers
ar: يجب أن تحتوي كلمة المرور على أكثر من 8 أحرف وأرقام

source: Already Have An Account?
ar: هل لديك حساب بالفعل؟

source: Alphabetical Z-A
ar: ترتيب أبجدي من الياء للألف

source: Alphabetical A-Z
ar: ترتيب أبجدي من الألف للياء

# mostPopular
source: Most PopularÙ‹
ar: الأكثر شيوعاً

source: minute
ar: دقيقة

# planProg
source: Plan
ar: برنامج

source: times
ar: مرات

source: time
ar: مرة

source: seconds
ar: ثواني

source: second
ar: ثانية

# privateSessionProg
source: Private Session
ar: تدريب خاص

# likeThisSession
source: Did you like this Session ?
ar: هل أعجبتك هذه الجلسة؟

# likeThisWorkoutPlan
source: Did you like this workout plan ?
ar: هل أعجبتك هذا البرنامج؟

source: session
ar: جلسة

# lateralRoeeetMedialLateral
source: Shoulder Medial Lateral Roeeet Medial Lateral
ar: الكتف الإنسي الجانبي رويت الإنسي الجانبي

source: Day 4
ar: اليوم 4

# lang
source: Language
ar: اللغة

source: Confirm password does not match password
ar: تأكيد كلمة المرور لا تطابق كلمة المرور

source: Password changed
ar: تم تغيير كلمة السر

source: Private Training
ar: تدريب خاص

source: How can I subscribe and pay?
ar: كيف يمكنني الاشتراك والدفع؟

# youCanSubscribeAndPay
source: You can subscribe and pay online through available payment options available through the application.
ar: يمكنك الاشتراك والدفع عبر الإنترنت من خلال خيارات الدفع المتاحة من خلال التطبيق.

source: Workout Location Field is Require
ar: حقل موقع التدريب مطلوب

source: Private Sessions
ar: التدريب الشخصي

source: subscription payment
ar: ادفع للاشتراك

# forgetPassword
source: Forgot Password?
ar: نسيت كلمة السر؟

# plsEnterEmail
source: Please Enter Your Email To Receive Activation Code
ar: يرجى إدخال البريد الإلكتروني لاستقبال رمز التفعيل

source: Email
ar: البريد الإلكتروني

# emailOrPhone
source: Email
ar: البريد الإلكتروني أو رقم الهاتف

# makeChat
source: You should be subscribed with this coach in particular to have a conversation
ar: يجب أن تكون مشتركًا مع هذا المدرب على وجه الخصوص لإجراء محادثة

# needBookPrivateSession
source: You need to book an appointment to have a private session with the coach
ar: يجب عليك حجز موعد للحصول على جلسة خاصة مع المدرب

source: Reset Password
ar: إعادة تعيين كلمة السر

# setNewPass
source: Set the new password to this account
ar: تعيين كلمة سر جديدة للحساب

source: Password
ar: كلمة السر

# reEnterPass
source: Re-Enter New Password
ar: إعادة إدخال كلمة السر الجديدة

source: Email Verification
ar: تأكيد البريد الإلكتروني

# phoneVerification
source: Email Verification
ar: تأكيد البريد

# sent6Digit
source: We have sent a 5-digit code to your email
ar: تم إرسال رمز تفعيل إلى بريدك الإلكتروني

source: Change Email
ar: تغيير البريد الإلكتروني

# changePhone
source: Change Phone Number
ar: تغيير رقم الهاتف

source: Resend Code
ar: إعادة إرسال رمز التفعيل

source: Sign In
ar: تسجيل الدخول

# signInTrainer
source: Sign in as a Trainer
ar: تسجيل الدخول كـ مدرب

source: Forgot Password ?
ar: هل نسيت كلمة السر ؟

# notMember
source: Not a Member ?
ar: لست مشترك بعد ؟

source: Sign Up
ar: إنشاء حساب

source: name
ar: الاسم

# bySingingUpYouAreAgreeingToOur
source: By signing up, you are agreeing to our policies
ar: بتسجيل الدخول، تعتبر موافقاً على سياستنا

source: Terms Of Conditions
ar: شروط الاستخدام

# finishedThisDay
source: User already finished this day
ar: لقد أنهيت تدريب هذا اليوم

source: and
ar: و

source: Already a Member ?
ar: لديك حساب مسبقاً؟

source: Login
ar: تسجيل الدخول

# subscriptionFinished
source: Your subscription to Fitness Storm has ended, kindly renew it to continue where you have stopped.
ar: لقد انتهى اشتراكك في Fitness Storm ، يرجى تجديده للمتابعة من حيث توقفت

source: Fitness Survey
ar: إحصائية بدنية

source: will be canceled
ar: سيتم إلغاء

# takeThisSurvey
source: Take this survey to get more personalized workout plan recommendations.
ar: الرجاء تعبئة المعلومات للحصول على اقتراحات مناسبة لكم

source: How often do you exercise?
ar: كم مرة تتدرب عادةً ؟

source: You Prefer to workout in
ar: تفضل التدرب في

source: Gym
ar: النادي

source: Home
ar: المنزل

# whatYourTrainingLevel
source: What"s your training level ?
ar: ماهو مستواك فى التدريب ؟

source: Beginner
ar: مبتدئ

source: Professional
ar: متقدم

source: What is your training goal ?
ar: ماهو هدفك من التدريب ؟

source: Lose weight
ar: خسارة الوزن

source: Build muscle
ar: بناء عضلات

source: Stay fit
ar: المحافظة على اللياقة

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Sec
ar: ثانية

source: Bookmarked Plans
ar: البرامج المحتفظ بها

source: Reset Filters
ar: إعادة تعيين الفلاتر

source: LOCATION
ar: العنوان

source: TRAINING TYPE
ar: نوع التدريب

source: SORT BY
ar: تصنيف حسب

source: Available sessions
ar: الجلسات المتاحة

source: WHAT WILL YOU GET IN THIS PRIVATE SESSION ?
ar: ما الذي ستحصل عليه في هذه الجلسة؟

# willProvidePersonalized
source: will provide personalized guidance and support. You"ll receive one-on-one attention, and form corrections. Reserve your session today to take your fitness journey to the next level.
ar: سوف نقدم لك متابعة مخصصة لك، بشكل مباشر مع المدرب وتجهيز برنامجك الرياضي وتصحيح الأخطاء، احجز جلستك اليوم لترفع من مستوى تدريبك.

source: CHOOSE TIME
ar: اختر الوقت

source: Chat
ar: المحادثات

source: Customer Service
ar: خدمة العملاء

source: Last message
ar: الرسالة الأخيرة

source: Exercise
ar: تدريب

source: Start Workout
ar: ابدأ التدريب

source: Set
ar: مجموعة

source: Min
ar: الحد الأدنى

source: Reps
ar: تكرار :

source: Our Workout
ar: برامجنا التدريبية

source: pull up load
ar: تخفيف أوزان

source: Load Failed!Click retry!
ar: فشل التحميل! يرجى المحاولة مرة أخرى

source: release to load more
ar: اسحب لتحميل المزيد

source: No more Data
ar: لا يوجد المزيد من المعلومات

source: Filter
ar: فلاتر البحث

source: Reset
ar: إعادة تعيين

source: Rep
ar: تكرار

source: LEVEL
ar: المستوى

source: Intermediate
ar: متوسط

source: Advanced
ar: متقدّم

source: Weight lifting
ar: رفع الأثقال

source: Body Weight
ar: وزن الجسم

source: HIIT Training
ar: تدريب HIIT

source: Strength Training
ar: تدريب قوة

source: Functional Training
ar: تدريب وظيفي

source: Mobility Training
ar: التدريب على التنقل

source: Sports Training
ar: تدريب رياضي

source: Dynamic Training
ar: تدريب ديناميكي

# folloAlong
source: Follow Along
ar: متابعة مع المدرّب

source: Body building
ar: بناء أجسام

source: Prenatal Training
ar: التدريب قبل الولادة

source: Hands-Free
ar: بدون استخدام اليدين

source: Pilates
ar: بيلاتيس

source: SEE ALL
ar: رؤية المزيد

source: Book
ar: حجز

source: Weeks
ar: أسابيع

source: The Weeks
ar: الأسابيع

source: Times/Week
ar: عدد مرات التدريب في الأسبوع

source: Next Up
ar: التالي

source: Day
ar: اليوم

source: Completed
ar: مكتمل

source: Continue Training
ar: متابعة التمرين

source: Workout plan . private
ar: برنامج التمرين / خاص

source: My Payments
ar: مدفوعاتي

source: NEXT PAYMENT
ar: الدفعة التالية

# didNotStartYourFitness
source: You didn"t Start your Fitness Storm Yet! Choose a plan and watch the change in your life.
ar: لم تبدأ بعد! اختر برنامجك الرياضى الآن وشاهد التغيير في حياتك.

source: Payment
ar: الدفع

source: SAR
ar: ريال سعودي

# didNotHaveNotifications
source: You don"t have any notifications Yet! Start your Fitness Storm and we will remind you here with your important sessions
ar: ليس لديك أي إشعارات بعد! ابدأ الآن وسنذكرك هنا بجلساتك المهمة

source: FINISH
ar: تم

source: What is your gender?
ar: ما هو جنسك؟

source: That"s all we need for now.
ar: هذا كل ما نحتاجه الآن.

source: All Finished!
ar: كل شيء جاهز!

source: Now go crush it
ar: الآن اذهب وحقق المستحيل

source: What is your birthday?
ar: ما هو تاريخ ميلادك؟

source: What is your height/weight?
ar: ما هو طولك؟

source: About The Coach
ar: معلومات حول المدرّب

source: Days/Week
ar: أيام التدريب في الأسبوع

source: The from is not a valid date
ar: التاريخ غير صحيح

source: About Us
ar: من نحن

source: Privacy Policy
ar: سياسة الخصوصية

source: FAQs
ar: الأسئلة الشائعة

source: Terms And Conditions
ar: الأحكام والشروط

source: Search Results
ar: نتائج البحث

source: Result
ar: النتائج

source: SORT
ar: تصنيف

source: No available sessions
ar: لا يوجد جلسات متاحة

source: Do you have any question in your mind?
ar: هل لديك أي أسئلة؟

source: Check our
ar: ألقي نظرة

source: or contact our
ar: أو تواصل مع

source: Customer Services
ar: خدمة العملاء

source: Subscription Plans
ar: باقات الاشتراك

source: Warning
ar: تحذير

# itIsAdvisable
source: It is advisable to cancel any existing subscription prior to initiating a new one
ar: برجاء إلغاء أي اشتراك موجود قبل بدء اشتراك جديد

source: Current Plan
ar: البرنامج الحالي

source: PLAN
ar: البرنامج

source: Cancel Subscription
ar: إلغاء الاشتراك

source: Take a Plan made customized for you!
ar: حقق أهدافك مع برنامج مخصص لك

# privateCoatching
source: PRIVATE COACHING
ar: التدريب الشخصى

source: Month
ar: الشهر

source: WELCOME
ar: مرحباّ

# congratulations
source: Congratulations on taking the first step towards your fitness journey with Fitness Storm. Now that you"ve subscribed, you have access to all of our resources. Choose a plan and let"s get started!
ar: تهانينا على اتخاذ الخطوة الأولى نحو رحلة اللياقة البدنية مع Fitness Storm. الآن بعد أن اشتركت، لديك إمكانية الوصول إلى جميع برامجنا. اختر برنامجك المفضل وابدأ الآن !

source: Successfully subscribed
ar: تم الاشتراك بنجاح

source: WHY TO SUBSCRIBE?
ar: لماذا يجب أن اشترك ؟

# joinFitnessStormForPersonalized
source: 11+ PLANS 13+TRAINERS UNLIMITED ACCESS
ar: أكثر من ١١ برنامج رياضى أكثر من ١٣ مدرب اشتراك غير محدود على جميع البرامج

# startYourJourney
source: Start your journey to a healthier you today!
ar: ابدأ رحلتك اليوم!

source: Profile info
ar: الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Delete Account
ar: حذف الحساب

source: No Name
ar: بدون اسم

source: Change Password
ar: تغيير كلمة المرور

source: Change
ar: تغيير

source: Sign Out
ar: تسجيل الخروج

source: birthday
ar: تاريخ الميلاد

source: Gender
ar: الجنس

source: Profile Details
ar: تفاصيل الملف الشخصي

source: You Often exercise
ar: تقوم عادةّ بممارسة الرياضة

source: Survey Info
ar: تفاصيل الاستبيان

source: Your training goal
ar: هدفك

source: You workout in
ar: أنت تمارس الرياضة في

source: Plans by this Trainer
ar: برامج المدرب

source: SAR/hour
ar: ريال سعودي لكل ساعة

source: Start private session
ar: ابدأ تدريبك الخاص

source: sets
ar: مجموعة

source: Trending Plan
ar: البرامج الأكثر رواجاً

source: FITNESS LEVEL
ar: مستوى لياقتك

# didYouFinishYourTraining
source: Did you finish your training? press Done to save your progress to your records.
ar: هل أنهيت تمارينك اليوم؟ اختر نعم ليتم حفظ تقدمك في السجل.

source: I"ll come back later
ar: سأنهيها لاحقاّ

source: Set X
ar: مجموعة *

# yourSubscriptionToPlan
source: You will be no longer training with plan
ar: سيتم إلغاء اشتراكك في خطة

source: Trainers
ar: مدربين

# youCanDoItThisSet
source: You can do it!
ar: انطلق لأنك تستطيع

source: Great Job!
ar: أحسنت صنعا!

source: Take a break
ar: خذ استراحة

source: before the next exercise
ar: قبل التمرين التالي

source: before the next set
ar: قبل المجموعة التالية

source: Repeat this Exercise
ar: أعد هذا التمرين

source: Slide to start the next Set
ar: اسحب للبدء بالتمرين التالي

# slideToStartTheTimerForThisSet
source: slide to start timer
ar: اسحب لبدء المؤقت

source: No Current Plan
ar: لا يوجد خطّة حالية

# ourTrainer
source: Our Trainers
ar: مدربينا

source: Plans
ar: البرامج

source: Subscriber
ar: المشتركين

source: Private hours
ar: الساعات الخصوصية

source: Trainer
ar: المدرب

# thereAreNoTRAINERS
source: There are no TRAINERS in your search results, you can check our trainers and use FILTERS to find what you are looking for
ar: لا يوجد مدربون في نتائج البحث الخاصة بك، يمكنك التحقق من المدربين لدينا واستخدام الفلاتر للعثور على ما تبحث عنه

source: There are no appointments this week
ar: لا توجد مواعيد هذا الأسبوع

source: It"s not time for the call yet
ar: «لم يحن وقت المكالمة بعد»

source: okay
ar: حسناّ

source: Start session
ar: بدأ الجلسة

source: My Calender
ar: تقويمي

source: Book Private Session
ar: احجز جلسة خاصّة

source: Book Session
ar: احجز جلسة

source: private session
ar: جلسة خاصّة

source: My Plans
ar: برامجى

source: My Profile
ar: ملفي الشخصي

source: SET MY AVAILABILITY
ar: حدد مدى توافري

source: PLANS BY ME
ar: البرامج التي وضعتها

source: CURRENT BALANCE
ar: الرصيد الحالي

source: No Wallet
ar: لا توجد محفظة

source: Income
ar: دخل

source: Balance
ar: رصيد

source: Download Invoice
ar: تحميل الفاتورة

source: Cancel
ar: إلغاء

source: Alert
ar: تحذير

source: SEARCH IN WORKOUT PLANS
ar: البحث في خطط التمرين

source: Search in Trainer
ar: البحث عن المدربين

source: Tap to Expand it
ar: انقر لرؤية المزيد

source: Profile
ar: الملف الشخصي

# termAndCondition
source: Terms And Conditions
ar: الشروط والأحكام

source: Video initialized
ar: تم استهلال الفيديو

source: Zumba
ar: زومبا

source: See More
ar: رؤية المزيد

# fitnessStormMessage
source: Fitness Storm is a spirited application encouraging people to exercise anywhere and anytime and have the look they have always dreamed of. Whether you are a beginner or a pro, Fitness Storm gives you a golden chance to train with world class trainers through HD step-by-step instructional videos. Lose weight, build muscle, and stay fit easily with the correct workouts and many effective training programs, designed by your favorite fitness experts. Sign up, answer a few questions, subscribe to one of our programs for 3 months, 6 months or 12 months and let us recommend the best plans that fits you. Get inspired with our amazing trainers and work out daily with step-by-step HD video instruction. Not convinced yet? To make every minute you train, play and compete â€“ count, one to one session a unique program will be offered at fitness storm . If you want a more individualized approach to achieve the weight-loss, health, strength, injury prevention, or performance goals you have set for yourself, this program is designed for you where you can have a personal coach/dietitian focusing on reaching your individual goals. It is time to be stronger, healthier, and happier than ever before with Fitness Storm!
ar: Fitness Storm هو تطبيق مفعم بالحيوية يشجع الناس على ممارسة الرياضة في أي مكان وزمان والحصول على المظهر الذي طالما حلموا به. سواء كنت مبتدئا أو محترفا ، تمنحك Fitness Storm فرصة ذهبية للتدريب مع مدربين عالميين من خلال مقاطع فيديو تعليمية عالية الدقة خطوة بخطوة. انقاص وزنك ، وقم ببناء العضلات ، وحافظ على لياقتك بسهولة من خلال التدريبات الصحيحة والعديد من برامج التدريب الفعالة ، التي صممها خبراء اللياقة البدنية المفضلون لديك. اشترك ، أجب عن بعض الأسئلة ، اشترك في أحد برامجنا لمدة 3 أشهر أو 6 أشهر أو 12 شهرا ودعنا نوصي بأفضل البرامج التي تناسبك. احصل على الإلهام مع مدربينا المذهلين ومارس التمارين يوميا من خلال تعليمات الفيديو عالية الدقة خطوة بخطوة. غير مقتنع بعد؟ لجعل كل دقيقة تتدرب فيها وتلعب وتتنافس - عد ، جلسة واحدة إلى جلسة واحدة سيتم تقديم برنامج فريد في عاصفة اللياقة البدنية. إذا كنت ترغب في اتباع نهج أكثر فردية لتحقيق أهداف إنقاص الوزن أو الصحة أو القوة أو الوقاية من الإصابات أو الأداء التي حددتها لنفسك ، فقد تم تصميم هذا البرنامج لك حيث يمكنك الحصول على مدرب شخصي / اختصاصي تغذية يركز على الوصول إلى أهدافك الفردية. حان الوقت لتكون أقوى وأكثر صحة وسعادة من أي وقت مضى مع Fitness Storm!

# globalKeysReparent
source: Widgets that have global keys reparent their subtrees when they are moved from one location in the tree to another location in " the tree. In order to reparent its subtree, a widget must arrive at its new location in the tree in the same animation frame in which it was removed from its old location the tree.
ar: تمثل الودجات التي تحتوي على مفاتيح عالمية شرائطها الفرعية عند نقلها من موقع واحد في الشجرة إلى موقع آخر في الشجرة. من أجل إعادة رسم خبرتها الفرعية، يجب أن تصل الأداة إلى موقعها الجديد في الشجرة في نفس إطار الرسوم المتحركة الذي تمت فيه إزالتها من موقعها القديم الشجرة.

source: NEXT
ar: التالي

# thereAreNoWorkout
source: There are no WORKOUT PLANS in your search results, you can check our workouts and use FILTERS to find what you are looking for
ar: لا توجد خطط تمرين في نتائج البحث الخاصة بك، يمكنك التحقق من التدريبات واستخدام الفلاتر للعثور على ما تبحث عنه

source: Email Is Required
ar: البريد الإلكتروني مطلوب

source: Invalid Email
ar: بريد إلكتروني غير صالح

# invalidPhone
source: Invalid Phone Number
ar: رقم جوال غير صالح

source: Check Your Email
ar: تحقق من بريدك الالكتروني

source: Password Is Required
ar: كلمة السر مطلوبة

source: Name Is Required
ar: الاسم مطلوب

source: Confirm Password Is Required
ar: تأكيد كلمة السر مطلوبة

source: Success
ar: تم التأكيد

source: Enter New Password
ar: أدخل كلمة مرور جديدة

source: Enter Email Address
ar: أدخل عنوان البريد الإلكتروني

source: Please Enter OTP Code
ar: الرجاء إدخال رمز OTP
